In [2]:
# Dependencies
import pandas as pd

In [3]:
# Load data into program
schools_data_to_load = "Resources/schools_complete.csv"
students_data_to_load = "Resources/students_complete.csv"

In [4]:
# Convert load data to pandas DataFrames
school_data_df = pd.read_csv(schools_data_to_load)
students_data_df = pd.read_csv(students_data_to_load)

In [5]:
# declare prefixes and suffixees list to remove from data
prefixes_suffixes = ["Dr. ", "Miss ", "Mr. ", "Mrs. ", "Ms. ", " DDS", " DVM", " MD", " PhD"]

In [6]:
# loop through students and replace prefixes and suffixes with ""
for x in prefixes_suffixes:
    students_data_df["student_name"] = students_data_df["student_name"].str.replace(x, "")

ipykernel_launcher:3: FutureWarning: The default value of regex will change from True to False in a future version.

In [7]:
students_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [33]:
school_data_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [10]:
students_data_df.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score'],
      dtype='object')

In [11]:
# combine data into single dataframe
school_data_complete_df = pd.merge(students_data_df, school_data_df, on=["school_name", "school_name"])
school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [26]:
# school_data_complete_df["School ID"].value_counts()

# get total number of students
student_count = school_data_complete_df["Student ID"].count()

In [30]:
school_count = school_data_df["school_name"].count()
school_count

# another way to figure out the total number of schools
# len(school_data_complete_df["School ID"].unique())

15

In [34]:
# calculate the total budget
total_budget = school_data_df["budget"].sum()
total_budget

24649428

In [35]:
# get average reading scores
average_reading_score = school_data_complete_df["reading_score"].mean()
average_reading_score

81.87784018381414

In [36]:
# get average math score
average_math_score = school_data_complete_df["math_score"].mean()
average_math_score

78.98537145774827

In [ ]:
# passing grade
# compare student reading score to passing grade
# compare student path score to passing grade
# calculate % passing reading
# calculate % passing math

In [37]:
# determine passing grades
passing_math = school_data_complete_df["math_score"] >= 70
passing_reading = school_data_complete_df["reading_score"] >= 70

In [38]:
passing_math.head()

0     True
1    False
2    False
3    False
4     True
Name: math_score, dtype: bool

In [40]:
# filter complete df for passing math
passing_math = school_data_complete_df[school_data_complete_df["math_score"] >= 70]
passing_math.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635

In [42]:
# filter complete df for passing reading
passing_reading = school_data_complete_df[school_data_complete_df["reading_score"] >= 70]
passing_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635

In [45]:
# calculate number of students passing math and passing reading
passing_math_count = passing_math["student_name"].count()
passing_reading_count = passing_reading["student_name"].count()

In [48]:
# calculate percentage passing math
passing_math_percent = passing_math_count / float(student_count) * 100
passing_reading_percent = passing_reading_count / float(student_count) * 100

print(passing_math_percent)
print(passing_reading_percent)

74.9808526933878
85.80546336482001

In [51]:
# number of students passing math and reading - take the original dataframe and make a new one based on specified columns and boolean values from comparison, each condition needs to be in ()
passing_math_and_reading = school_data_complete_df[(school_data_complete_df["math_score"]  >= 70) & (school_data_complete_df["reading_score"] >= 70)]
passing_math_and_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

In [53]:
passing_math_and_reading.student_name.count()

25528

In [57]:
# calculate the number of students who passed math and reading
overall_passing_math_reading_count = passing_math_and_reading["student_name"].count()
overall_passing_percentage = passing_math_and_reading["student_name"].count() / float(student_count) * 100

In [58]:
# create new DataFrame for summary data - dictionary format using new column names and list of calculated values to fill series
district_summary_df = pd.DataFrame([{"Total Schools": school_count,
          "Total Students": student_count,
          "Total Budget": total_budget,
          "Average Math Score": average_math_score,
          "Average Reading Score": average_reading_score,
          "% Passing Math": passing_math_percent,
         "% Passing Reading": passing_reading_percent,
        "% Overall Passing": overall_passing_percentage}])
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [67]:
# formatting output
district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)

ValueError: Cannot specify ',' with 's'.

In [68]:
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170",24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [71]:

district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)

In [72]:
district_summary_df["Total Budget"]

0    $24,649,428.00
Name: Total Budget, dtype: object

In [74]:
district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map("{:.1f}".format)

In [75]:
district_summary_df["Average Reading Score"] = district_summary_df["Average Reading Score"].map("{:.1f}".format)

district_summary_df["% Passing Math"] = district_summary_df["% Passing Math"].map("{:.0f}".format)

district_summary_df["% Passing Reading"] = district_summary_df["% Passing Reading"].map("{:.0f}".format)

district_summary_df["% Overall Passing"] = district_summary_df["% Overall Passing"].map("{:.0f}".format)

In [76]:
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65

In [78]:
# reorder columns to preferred format
new_column_order = ["Total Schools", "Total Students", "Total Budget", "Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]
district_summary_df = district_summary_df[new_column_order]
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65